## 2. Pandas 내장 함수
***

In [61]:
import pandas as pd

titanic = pd.read_csv("Video_Lecture_NBs/titanic.csv")

In [62]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [19]:
# type() : 객체의 데이터 타입을 확인할 수 있는 함수
type(titanic)

pandas.core.frame.DataFrame

In [20]:
# len() : 리스트 속 요소의 개수를 알 수 있는 함수, 문자열에도 해당됨
# 데이터 프레임의 행의 개수를 반환
len(titanic)

891

In [25]:
# round() : 반올림 함수, 숫자로된 열의 모든 요소들이 0의자리 또는 소수점 이하로 반올림 된 것을 알 수 있음
round(titanic, 0)

     survived  pclass     sex   age  sibsp  parch  fare embarked deck
0           0       3    male  22.0      1      0   7.0        S  NaN
1           1       1  female  38.0      1      0  71.0        C    C
2           1       3  female  26.0      0      0   8.0        S  NaN
3           1       1  female  35.0      1      0  53.0        S    C
4           0       3    male  35.0      0      0   8.0        S  NaN
..        ...     ...     ...   ...    ...    ...   ...      ...  ...
886         0       2    male  27.0      0      0  13.0        S  NaN
887         1       1  female  19.0      0      0  30.0        S    B
888         0       3  female   NaN      1      2  23.0        S  NaN
889         1       1    male  26.0      0      0  30.0        C    C
890         0       3    male  32.0      0      0   8.0        Q  NaN

[891 rows x 9 columns]

In [ ]:
# int() : int() 함수의 인자는 문자열이나 숫자여야하고 데이터프레임의 경우는 반환되지 않음
int(titanic)

TypeError: int() argument must be a string, a bytes-like object or a real number, not 'DataFrame'

In [35]:
# min() : 아래와 같이 사용될 경우 칼럼 레이블의 최소값을 반환한다. 알파벳으로 이루어졌기 때문에 'a'로 시작하는 'age'칼럼 레이블이 출력됨
min(titanic)

'age'

### * dataframe attributes(속성)

In [44]:
# shape : 행, 열의 개수를 반환
titanic.shape

(891, 9)

In [37]:
# size : 행 * 열의 개수를 반환
titanic.size

8019

In [41]:
# index : 인덱스 정보를 반환 (start, 행 개수, 행 간격)
titanic.index

RangeIndex(start=0, stop=891, step=1)

In [42]:
# colunms : 칼럼명, 객체(여기선 titanic)의 타입 반환 
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'deck'],
      dtype='object')

### * dataframe methods(메소드)

In [48]:
# head() : 'n' 이라는 매개변수를 사용해서 원하는 행의 개수를 출력할 수 있다. 숫자만 작성해도 반환됨
titanic.head(3)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN

In [49]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [66]:
# min() : 각 칼럼의 최소값을 반환함, 숫자형만 가능
titanic.min(numeric_only=True)

survived    0.00
pclass      1.00
age         0.42
sibsp       0.00
parch       0.00
fare        0.00
dtype: float64

### * method chaining(체인 기법)
바로가기 : [Pandas : DataFrame attributes & method]("https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html")

In [82]:
# 메소드 + 메소드 + 메소드
# mean() : 각 칼럼 레이블의 평균값 
# sort_values : 오름차순으로 정렬
titanic.mean(numeric_only=True).sort_values().head(n=2)

parch       0.381594
survived    0.383838
dtype: float64